### Import & Export Datasets:

In this project, we are going to demonstrate how to import and export datasets using python commands.

### Python Libraries:

We need to import the following python libraries for this analysis.

In [4]:
import os
import pandas as pd

With the following python command, we print the current working directory.

In [34]:
print(os.getcwd())

C:\Users\Owner\Desktop\Import Export Data\Import Export

### Reading a text file:

With the following python command, we import the text file with the values separated by commas. We use the head function to print the first five rows of the dataset.

In [35]:
adult = pd.read_table('adult.txt', sep = ',', header = None) 
adult.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

### Reading a tab separated file:

With the following python command, we import the text file with the values separated by tabs. To print the dataset, we simply type data.

In [36]:
data = pd.read_table('data.txt', sep = '\t', header = None)
data

       0   1
0   Mark  32
1   Matt  29
2   John  67
3  Jason  45
4   Matt  12
5  Frank  11
6  Frank  34
7  Frank  65
8  Frank  78

### Reading a csv file:

With the following python command, we import the csv (the values separated by commas) file. To print the first five rows of the dataset, we use head function.

In [37]:
purchase = pd.read_csv('purchases.csv', index_col = 0)
purchase.head()

,"?""userid""",treatment,ordernumber,productid,price,units,date,timestamp
0,1,1,31736,593428575,3609,1,2013-01-03,1357233447154
1,1,1,31736,184498760,1109,1,2013-01-03,1357233447154
2,1,1,31736,184498820,1289,1,2013-01-03,1357233447154
3,2,0,26267,904417749,11999,1,2013-01-02,1357155342821
4,3,1,13041,544126719,9999,1,2012-12-27,1356620034710

### Reading a pipe separated file:

We import the values separated by pipes with the following python command. We print the first five rows of the dataset with the head function.

In [38]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep = '|', 
                      header = None, names = user_cols, index_col = 'user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Exporting an Excel file:

We export the excel file from this notebook to the current working directory, we use the following python command.

In [39]:
users.to_excel('users_copy.xlsx', index=False)
print('Done')

Done

### Importing an excel file:

We can also export the excel file with the pandas command, and print the first five rows with the head function.

In [40]:
users_copy = pd.read_excel('users_copy.xlsx')
users_copy.head()

   age gender  occupation zip_code
0   24      M  technician    85711
1   53      F       other    94043
2   23      M      writer    32067
3   24      M  technician    43537
4   33      F       other    15213

### Exporting csv file:

To export the csv file, we use the following python command.

In [41]:
adult.to_csv('adult.csv', index=False)
print('Done')

Done

### Exporting an Excel file:

We also export the excel file with the following python command.

In [42]:
adult.to_excel('adult_copy.xls', index=False)
print('Done')

Done

### Exporting a txt file:

With the following python command, we export the text file as a csv file.

In [43]:
purchase.to_csv('purchase_copy.txt', index=False)
print('Done')

Done

### Importing file without using a pandas module:

In [44]:
import csv

In [45]:
x = []
y = []

In [46]:
with open('example.txt', 'r') as csvfile:
    plots = csv.reader(csvfile, delimiter = ',')
    for row in plots:
        x.append(int(row[0]))
        y.append(int(row[1]))

In [47]:
x

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [48]:
y

[5, 3, 4, 7, 4, 3, 5, 7, 4, 4]

### Reading a Semi-colon seperated value dataset:

In [49]:
brain_size = pd.read_csv('brain_size.csv', sep=';', na_values='.')
brain_size.head()

   Unnamed: 0  Gender  FSIQ  VIQ  PIQ  Weight  Height  MRI_Count
0           1  Female   133  132  124   118.0    64.5     816932
1           2    Male   140  150  124     NaN    72.5    1001121
2           3    Male   139  123  150   143.0    73.3    1038437
3           4    Male   133  129  128   172.0    68.8     965353
4           5  Female   137  132  134   147.0    65.0     951545

### Extracting a file from online and importing:

In [50]:
import urllib
from urllib.request import urlretrieve

In [51]:
if not os.path.exists('wages.txt'):
    urllib.request.urlretrieve('http://lib.stat.cmu.edu/datasets/CPS_85_Wages',
                       'wages.txt')

In [52]:
data = pd.read_csv('wages.txt', skiprows=27, skipfooter=6, sep=None, engine = 'python',
                       header=None, names=['education', 'gender', 'wage'],
                       usecols=[0, 2, 5],)

### Reading first five rows of the dataset.

In [53]:
data.head()

   education  gender  wage
0          8       1  5.10
1          9       1  4.95
2         12       0  6.67
3         12       0  4.00
4         12       0  7.50

### Importing a file with multiple delimiter:

In [54]:
if not os.path.exists('housing.txt'):
    urllib.request.urlretrieve('https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data',
                       'housing.txt')

In [55]:
housing_col = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 
               'RAD', 'TAX', 'PIRATIO', 'B', 'LSTAT', 'MEDV']

In [56]:
housing = pd.read_table('housing.txt', header = None, names = housing_col, sep = '\s+', engine = 'python')
housing.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PIRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

### Reading a file from quandl:

In [57]:
import quandl

In [58]:
df = quandl.get('WIKI/GOOGL')
df.head()

,Open,High,Low,Close,Volume,Ex-Dividend,Split Ratio,Adj. Open,Adj. High,Adj. Low,Adj. Close,Adj. Volume
Date,,,,,,,,,,,,
2004-08-19,100.01,104.06,95.96,100.335,44659000.0,0.0,1.0,50.159839,52.191109,48.128568,50.322842,44659000.0
2004-08-20,101.01,109.08,100.50,108.310,22834300.0,0.0,1.0,50.661387,54.708881,50.405597,54.322689,22834300.0
2004-08-23,110.76,113.48,109.05,109.400,18256100.0,0.0,1.0,55.551482,56.915693,54.693835,54.869377,18256100.0
2004-08-24,111.24,111.60,103.57,104.870,15247300.0,0.0,1.0,55.792225,55.972783,51.945350,52.597363,15247300.0
2004-08-25,104.76,108.00,103.88,106.000,9188600.0,0.0,1.0,52.542193,54.167209,52.100830,53.164113,9188600.0

### The following python library is for importing the excel file.

In [59]:
import xlrd

In [60]:
users = "C:/Users/Owner/Desktop/Import Export Data/Import Export/users_copy.xlsx"
workbook = xlrd.open_workbook(users)

sheet = workbook.sheet_by_index(0) # 0 = sheet1, 1 = sheet2, etc.

#sheet.cell_value(0, 0)
#sheet.nrows
sheet.ncols

4

http://xlrd.readthedocs.io/en/latest/api.html

### Reading Excel file:

In [61]:
football = pd.read_excel('football.xlsx', 'Sheet1')
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [62]:
football.to_excel('football.xlsx', index=False)

### Delete the DataFrame:

In [63]:
del football

### Reading a tab separated file from url:

In [64]:
url = 'https://raw.github.com/gjreda/best-sandwiches/master/data/best-sandwiches-geocode.tsv'

from_url = pd.read_table(url, sep='\t')
from_url.iloc[0:3, 0:6]

,rank,sandwich,restaurant,description,price,address
0,1,BLT,Old Oak Tap,The B is applewood smoked&mdash;nice and snapp...,$10,2109 W. Chicago Ave.
1,2,Fried Bologna,Au Cheval,Thought your bologna-eating days had retired w...,$9,800 W. Randolph St.
2,3,Woodland Mushroom,Xoco,Leave it to Rick Bayless and crew to come up w...,$9.50.,445 N. Clark St.

### Reads only first four columns:

In [65]:
from_url = pd.read_table(url, sep='\t', usecols = [1,2,3,4])
from_url.head(3)

,sandwich,restaurant,description,price
0,BLT,Old Oak Tap,The B is applewood smoked&mdash;nice and snapp...,$10
1,Fried Bologna,Au Cheval,Thought your bologna-eating days had retired w...,$9
2,Woodland Mushroom,Xoco,Leave it to Rick Bayless and crew to come up w...,$9.50.

### Some more python libraries:

In [2]:
import datetime
import pandas.io.data as web

In [33]:
start = datetime.datetime(2010, 1, 1)
end = datetime.datetime(2015, 1, 1)

df = web.DataReader('XOM', 'yahoo', start, end)
df.head()

                 Open       High        Low      Close    Volume  Adj Close
Date
2010-01-04  68.720001  69.260002  68.190002  69.150002  27809100  56.187171
2010-01-05  69.190002  69.449997  68.800003  69.419998  30174700  56.406554
2010-01-06  69.449997  70.599998  69.339996  70.019997  35044700  56.894077
2010-01-07  69.900002  70.059998  69.419998  69.800003  27192100  56.715323
2010-01-08  69.690002  69.750000  69.220001  69.519997  24891800  56.487807

### Reading html file:

In [34]:
fiddy_states = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states')

### Reading first five rows:

In [35]:
fiddy_states[0].head()

              0           1            2                  3
0  Abbreviation  State Name      Capital     Became a State
1            AL     Alabama   Montgomery  December 14, 1819
2            AK      Alaska       Juneau    January 3, 1959
3            AZ     Arizona      Phoenix  February 14, 1912
4            AR    Arkansas  Little Rock      June 15, 1836

### Excluding the first row:

In [55]:
df = fiddy_states[0].iloc[1:, :].copy()
df.head()

    0           1            2                  3
1  AL     Alabama   Montgomery  December 14, 1819
2  AK      Alaska       Juneau    January 3, 1959
3  AZ     Arizona      Phoenix  February 14, 1912
4  AR    Arkansas  Little Rock      June 15, 1836
5  CA  California   Sacramento  September 9, 1850

### Renaming columns:

In [57]:
df.rename(columns = {0: 'Abbreviation', 1: 'State Name', 2: 'Capital', 3: 'Became a State'}, inplace = True)
df.head()

  Abbreviation Abbreviation   State Name            Capital
1           AL      Alabama   Montgomery  December 14, 1819
2           AK       Alaska       Juneau    January 3, 1959
3           AZ      Arizona      Phoenix  February 14, 1912
4           AR     Arkansas  Little Rock      June 15, 1836
5           CA   California   Sacramento  September 9, 1850